transonic-dlrbuffet-rhoCentralRKFoam/setups.orig/laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    PER_LEFT_1
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          220;
        startFace       194320;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_RIGHT_1;
        separationVector (0 -0.0495 0);
    }
    PER_RIGHT_1
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          220;
        startFace       194540;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_LEFT_1;
        separationVector (0 0.0495 0);
    }
    PER_LEFT_2
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          220;
        startFace       194760;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_RIGHT_2;
        separationVector (0 -0.0495 0);
    }
    PER_RIGHT_2
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          220;
        startFace       194980;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_LEFT_2;
        separationVector (0 0.0495 0);
    }
    PER_LEFT_3
    {
        type            cyclic;
        inGroups        2(row_1_PER1 cyclic);
        nFaces          172;
        startFace       195200;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_RIGHT_3;
        separationVector (0 -0.0495 0);
    }
    PER_RIGHT_3
    {
        type            cyclic;
        inGroups        2(row_1_PER2 cyclic);
        nFaces          172;
        startFace       195372;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  PER_LEFT_3;
        separationVector (0 0.0495 0);
    }
    INLET
    {
        type            patch;
        nFaces          144;
        startFace       195544;
    }
    OUTLET
    {
        type            patch;
        nFaces          144;
        startFace       195688;
    }
    Blade
    {
        type            wall;
        inGroups        1(wall);
        nFaces          504;
        startFace       195832;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          97664;
        startFace       196336;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          97664;
        startFace       294000;
    }
)

// ************************************************************************* //
